tutorials/reactingQGDFoam/3D/JetH2/constant/reactingCloudProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "constant";
    object      SprayCloudProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solution
{
    active          true;
    coupled         true;
    transient       true;
    cellValueSourceCorrection false;
    maxCo           0.3;

    sourceTerms
    {
        schemes
        {
            rho             explicit 1;
            U               semiImplicit 1;
            Yi              semiImplicit 1;
            h               semiImplicit 1;
            radiation       explicit 1;
        }
    }

    interpolationSchemes
    {
        rho             cell;
        U               cell;
        thermo:mu       cell;
        T               cell;
        Cp              cell;
        kappa           cell;
        p               cell;
    }

    integrationSchemes
    {
        U               Euler;
        T               Euler;
    }
}

//Вода
constantProperties
{
    T0              293;
    rho0            1000;
    Cp0             4187; 			//удельная теплоескость
    constantVolume  false;
}


subModels
{
    particleForces
    {
        sphereDrag;				//сферическое сопротивление 
//        gravity;				//гравитация
    }

    //Модель впрыскивания:
//    injectionModels
//    {
//	#include "injection"
//    }

    //Модель взаимодействия частиц со стенкой
    patchInteractionModel none; //localInteraction; 
//
//    localInteractionCoeffs
//    {
//	patches
//	(
//	    outlet
//	    {
//	        type escape;
//	    }
//
//	    inlet
//	    {
//	        type escape;
//	    }
//
//	    wall
//	    {
//	        type stick;
//	        type        rebound; //stick, escape
//        	e           0.1;     //нормальная составляющая скорости
//         	mu          0;       //тангенциальная составляющая скорости
//	    }
//
//	);
//    }

    heatTransferModel RanzMarshall; 		//none;
    RanzMarshallCoeffs
    {
        BirdCorrection  false;
    }

    compositionModel singlePhaseMixture; 	//none;

    singlePhaseMixtureCoeffs
    {
        phases
        (
            liquid
            {
//              H2O    1;
            }
        );
        YGasTot0       0;
        YLiquidTot0    0;
        YSolidTot0     1;
    }


    phaseChangeModel none; //liquidEvaporation;   //Модели испарения капель
//    liquidEvaporationCoeffs
//    {
//        enthalpyTransfer latentHeat;    
//        activeLiquids    ( H2O );       
//    }

    dispersionModel none; 			//Модель дисперсии 

    devolatilisationModel none; 		
    
    surfaceReactionModel none; 			
    
    stochasticCollisionModel none; 		//Стохастическая модель соударения
    
    surfaceFilmModel none; 			//Модель взаимодействия частиц с поверхностной пленкой

    radiation       off; 	

    atomizationModel none;

    breakupModel    TAB; 

    TABCoeffs
    {
        SMDCalculationMethod method2; 
        Comega  8; 
        Cmu     5; 
        WeCrit  12; 
    } 
		
}


cloudFunctions
{}


// ************************************************************************* //
