tutorials/reactingQGDFoam/3D/JetH2/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 40000;

boundaryField
{
    inlet 
    {
        type             uniformFixedValue;
        uniformValue     table
        (
          (0         40000)
          (0.000391  40000)
          (0.000780  40000)
          (0.000820  40000)
          (0.000879  54100)
          (0.000959  73426)
          (0.001048  91835)
          (0.001108  109317)
          (0.001157  135989)
          (0.001187  158059)
          (0.001226  171859)
          (0.001276  188419)
          (0.001316  209572)
          (0.001355  228888)
          (0.001365  248887)
          (0.001395  260153)
          (0.001434  277630)
          (0.001444  290502)
          (0.001483  307059)
          (0.001513  324533)
          (0.001543  336492)
          (0.001583  355807)
          (0.001652  386161)
          (0.001711  410997)
          (0.001741  427552)
          (0.001810  447794)
          (0.001880  468956)
          (0.001949  489198)
          (0.001992  507597)
          (0.002089  526925)
          (0.002168  541654)
          (0.002238  556381)
          (0.002318  566514)
          (0.002427  581251)
          (0.002578  595999)
          (0.002686  606139)
          (0.002806  617202)
          (0.002955  626434)
          (0.003095  634744)
          (0.003265  642143)
          (0.003405  642143)
          (0.003574  642143)
          (0.003734  642143)
          (0.004     642143)
          (0.007     642143)
        );

//        type            fixedValue;
//        value           uniform 1200000;
    }

    outlet
    {
        type             zeroGradient;
    }

    "(topAndBottom|back)"
    {
          type            zeroGradient;
    }

    sym
    {
         type             symmetry;
    }

    leftwall //tube
    {
        type             zeroGradient;
    }
}

// ************************************************************************* //
