tutorials/reactingQGDFoam/3D/JetH2/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.0;

boundaryField
{
     inlet
    {
        type            fixedValue;
        value           uniform 293.0;
//        type            zeroGradient;
    }

    outlet
    {
        type            zeroGradient;
    }

    "(topAndBottom|back)"
    {
        type            zeroGradient;
    }

    sym
    {
        type            symmetry; //zeroGradient;
    }

    leftwall 
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
